In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
from numpy.random import randn

In [4]:
np.random.seed(101)

In [5]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z']) # Creating a data frame

In [8]:
df # Cool df which actually looks like excell @ column is actually a series which shares an index

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [11]:
df['W'] # Grabbing a column from a data frame

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [10]:
type(df['W'])

pandas.core.series.Series

In [12]:
# Grabbing a column from a data frame using SQL 
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [14]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [27]:
# Creating a new column 
df['new'] = df['W'] + df['Y']

In [28]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [29]:
# Remove col
df.drop('new',axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [30]:
df # I still have the 'new' col. Pandas does this so as NOT to lose your data

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [32]:
 df.drop('new',axis=1,inplace=True) # pass a bool of True for 'inplace' for a recursive removal

In [33]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [35]:
# To drop rows. (dropping the 'E' row)
df.drop('E') # or df.drop('E',axis=0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [36]:
df.shape # rows are refered to as the '0' axis and col as the '1' axis

(5, 4)

In [37]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [43]:
# Selecting rows. Call 2 method names. (1. loc{location} 2.index position )
df.loc['C']

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [42]:
# index position
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [44]:
# Selecting subsets of rows and cols 
df.loc['B','Y']

-0.8480769834036315

In [46]:
df.loc[['A','B'],['W','Y']] # Subset of df

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

### Conditional Selection

In [47]:
# Conditional selection (CS)
# CS using bracket selection
df > 0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [48]:
booldf = df > 0

In [50]:
booldf # Call the variable, next use it in bracket notation

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [53]:
df[booldf] # Would be the same if I passed df[ df > 0]. But gr8 things are done the cool way

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [56]:
df['W'] > 0 # Returns a series. I can use the series to filter further

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [57]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [58]:
df[df['Z']<0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [59]:
resultdf = df[df['W']>0]

In [61]:
resultdf['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [64]:
df[df['W']>0]['X'] # Chaining W and X together

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [66]:
# I can even pass as a list 
df[df['W']>0][['Y','X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [72]:
# Breaking down into steps
# Getting compfy with pandas, use one line abstraction to save memory
boolser = df['W']>0
result = df[boolser]
mycols = ['Y','X']
result[mycols]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [69]:
result

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [73]:
# The concept of using multiple conditions 
# Comparing series of multiple values 
# Use a single ampersand and not 'and' or double ampersands whilst comparing. 


df[(df['W']>0) & (df['Y']>1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [74]:
# Use a single pipe operator for 'or'

df[(df['W']>0) | (df['Y']>1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

### Resetting Indexes or setting them to something else

In [75]:
print('\n' * 5)

In [77]:
df.reset_index() # Resetting index to a numerical value

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [80]:
# creating a new index 
# Create a list first

newind = 'MCR LON CAR EDB SHF'.split()

In [79]:
newind

['MCR', 'LON', 'CAR', 'EDB', 'SHF']

In [83]:
df['Cities'] = newind # Adding new cities to the data frame

In [82]:
df

          W         X         Y         Z Cities
A  2.706850  0.628133  0.907969  0.503826    MCR
B  0.651118 -0.319318 -0.848077  0.605965    LON
C -2.018168  0.740122  0.528813 -0.589001    CAR
D  0.188695 -0.758872 -0.933237  0.955057    EDB
E  0.190794  1.978757  2.605967  0.683509    SHF

In [84]:
# Changing the cities col to become the index 

df.set_index('Cities')

               W         X         Y         Z
Cities
MCR     2.706850  0.628133  0.907969  0.503826
LON     0.651118 -0.319318 -0.848077  0.605965
CAR    -2.018168  0.740122  0.528813 -0.589001
EDB     0.188695 -0.758872 -0.933237  0.955057
SHF     0.190794  1.978757  2.605967  0.683509

In [85]:
print("\n" * 5)

### Multi-index and index hierachy

In [87]:
# index levels to be used to build the df

outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [88]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [89]:
inside

[1, 2, 3, 1, 2, 3]

In [92]:
list(zip(outside,inside)) # list of tuple pairs

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [93]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           codes=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [95]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [98]:
df # Multi level index (hierachy) well visualized

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [100]:
# Calling data from a multi level index 
df.loc['G1'] # Grab everything under G1

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [101]:
df.loc['G2']

          A         B
1  0.166905  0.184502
2  0.807706  0.072960
3  0.638787  0.329646

In [104]:
df.index.names = ['Groups','Num'] # Two labelled indexes, i.e Groups & Num

In [103]:
df

                   A         B
Groups Num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [107]:
df.loc['G2'].loc[2]['B'] # Grabbing a single value. i.e Group G2 Num 2 row B

0.07295967531703869

In [115]:
df.loc['G1'].loc[3]['A']

-0.13484072060601238

In [116]:
# 'xs' returns a cross-section of rows or columns and it's used when you have multi-level index

In [117]:
df

                   A         B
Groups Num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [119]:
# Grabbing everything under G1 without using df.loc['G1']
df.xs('G1')

            A         B
Num
1    0.302665  1.693723
2   -1.706086 -1.159119
3   -0.134841  0.390528

In [120]:
df.xs(1,level='Num')

               A         B
Groups
G1      0.302665  1.693723
G2      0.166905  0.184502